var city = [
  {
    "name": "广东",
    "sub": [
      {
        "name": "广州",
        "sub": [
          {
            "name": "越秀区"
          },
          {
            "name": "荔湾区"
          },
          {
            "name": "海珠区"
          },
          {
            "name": "天河区"
          },
          {
            "name": "白云区"
          },
          {
            "name": "黄埔区"
          },
          {
            "name": "番禺区"
          },
          {
            "name": "花都区"
          },
          {
            "name": "南沙区"
          },
          {
            "name": "萝岗区"
          },
          {
            "name": "增城市"
          },
          {
            "name": "从化市"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      ]
   },
   {
    "name": "广东",
    "sub": [
      {
        "name": "广州",
        "sub": [
          {
            "name": "越秀区"
          },
          {
            "name": "荔湾区"
          },
          {
            "name": "海珠区"
          },
          {
            "name": "天河区"
          },
          {
            "name": "白云区"
          },
          {
            "name": "黄埔区"
          },
          {
            "name": "番禺区"
          },
          {
            "name": "花都区"
          },
          {
            "name": "南沙区"
          },
          {
            "name": "萝岗区"
          },
          {
            "name": "增城市"
          },
          {
            "name": "从化市"
          },
          {
            "name": "其他"
          }
        ],
        "type": 0
      },
      ]
   },
  ]